==========
Sequence
==========
B<bold>
----------
(pod
  (plain_paragraph
    (content
      (interior_sequence (sequence_letter) (content)))))
==========
Empty sequence
==========
Z<>
----------
(pod
  (plain_paragraph
    (content
      (interior_sequence (sequence_letter)))))
==========
Mixed sequence/content
==========
normal B<bold> content
----------
(pod
  (plain_paragraph
    (content
      (interior_sequence (sequence_letter) (content)))))
==========
Nested sequence
==========
B<I<bold italic>>
----------
(pod
  (plain_paragraph
    (content
      (interior_sequence
        (sequence_letter)
        (content
          (interior_sequence (sequence_letter) (content)))))))
